notrynohigh/ble_bridge_nrf52832/examples/ble_central/ble_app_uart_c/main.c
/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in] event  Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_ble_nus_c.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            break;
    }
}

/**@brief Function for initializing the UART. */
static void uart_init(void)
{
    ret_code_t err_code;

    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
        .baud_rate    = UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);

    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the NUS Client. */
static void nus_c_init(void)
{
    ret_code_t       err_code;
    ble_nus_c_init_t init;

    init.evt_handler = ble_nus_c_evt_handler;

    err_code = ble_nus_c_init(&m_ble_nus_c, &init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds. */
static void buttons_leds_init(void)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LED, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the timer. */
static void timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module. */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing the Power manager. */
static void power_init(void)
{
    ret_code_t err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/** @brief Function for initializing the Database Discovery Module. */
static void db_discovery_init(void)
{
    ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief uart send/rec functions
 */

void uart_send_string(uint8_t *pstr)
{
    if(pstr != NULL)
    {
        while(*pstr != '\0')
        {
            app_uart_put(*pstr);
            pstr++;
        }
    }
}

void uart_send_buff(uint8_t *pbuf, uint16_t len)
{
    uint16_t i = 0;
    if(pbuf == NULL)
    {
        return;
    }
    for(i = 0;i < len;i++)
    {
        app_uart_put(pbuf[i]);
    }
}

uint16_t uart_rec_buff(uint8_t *pbuf, uint16_t len)
{
    uint16_t i = 0;
    if(pbuf == NULL)
    {
        return 0;
    }
    for(i = 0;i < len;i++)
    {
        if(NRF_ERROR_NOT_FOUND == app_uart_get(pbuf))
        {
            break;
        }
        pbuf++;
    }
    return i;
}



/**
 * @brief loop timer
 */
APP_TIMER_DEF(utimer_20ms_id);
#define UART_RX_LEN         256
static uint8_t urx_table[UART_RX_LEN];
#define UTIMER_20MS_INTERVAL    APP_TIMER_TICKS(20)

static void _timer_20ms_handler(void *parg)
{
    uint16_t len = 0;
    uint32_t i = 0;
    static uint16_t s_len = 0;
    len = uart_rec_buff(&urx_table[s_len], UART_RX_LEN - s_len);
    if(len > 0)
    {
        s_len += len;
    }
    else if(s_len > 0)
    {   
        if(s_len <= B_TP_MTU)
        {
            b_tp_receive_data(urx_table, s_len);
        }
        else
        {
            for(i = 0;i < (s_len / B_TP_MTU); i++)
            {
                b_tp_receive_data(&urx_table[i * B_TP_MTU], B_TP_MTU);
            }
            if(s_len % B_TP_MTU)
            {
                b_tp_receive_data(&urx_table[i * B_TP_MTU], (s_len % B_TP_MTU));
            }
        }        
        s_len = 0;
    }
    uint32_t err_code = app_timer_start(utimer_20ms_id, UTIMER_20MS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);    
}

static void user_timer_init()
{
	uint32_t err_code;
    err_code = app_timer_create(&utimer_20ms_id, APP_TIMER_MODE_SINGLE_SHOT, _timer_20ms_handler);
    APP_ERROR_CHECK(err_code);
}


static void user_timer_start()
{
	uint32_t err_code;
    err_code = app_timer_start(utimer_20ms_id, UTIMER_20MS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

/** timer end */

/**
 * @proto
 */

uint8_t tmp_table[256];
uint8_t tmp_flag = 0;
tcmd_pstruct_t rec_result;


void b_tp_callback(b_TPU8 *pbuf, b_TPU32 len)
{
    tcmd_struct_t *ptmp = (tcmd_struct_t *)pbuf;
    uint8_t off = STRUCT_OFF(tcmd_struct_t, buf);
    if(len < off)
    {
        return;
    }
    rec_result.cmd = ptmp->cmd;
    rec_result.status = ptmp->status;
    memcpy(tmp_table, ptmp->buf, len - off);
    if(len == off)
    {
        rec_result.pbuf = NULL;
    }
    else
    {
        rec_result.pbuf = tmp_table;
    }
    tmp_flag = 1;
}

/*************************************************************************************/

void tc_scan(uint8_t *pbuf)
{
    static uint8_t scan_flag = 0;
    pro_scan_require_t *ptmp = (pro_scan_require_t *)pbuf;
    if(pbuf == NULL)
    {
        return;
    }
    if(ptmp->type == 0)
    {
        if(scan_flag == 1)
        {
            scan_stop();
            scan_flag = 0;
        }
    }
    else
    {
        if(scan_flag == 0)
        {
            scan_start();
            scan_flag = 1;
        }
    }
}


void tc_parse(tcmd_pstruct_t result)
{
    switch(result.cmd)
    {
        case CMD_TOOL_SCAN:
            tc_scan(result.pbuf); 
            break;
        default:
            tc_send(result.cmd, CMD_STATUS_UNKNOWN, NULL, 0);
            break;
    }
}



/*************************************************************************************/
int main(void)
{
    log_init();
    timer_init();
    power_init();
    uart_init();
    user_timer_init();
    b_tp_reg_callback(b_tp_callback);
    buttons_leds_init();
    db_discovery_init();
    ble_stack_init();
    gatt_init();
//    nus_c_init();
    
    // Start scanning for peripherals and initiate connection
    // with devices that advertise NUS UUID.
//    printf("BLE UART central example started.\r\n");
//    NRF_LOG_INFO("BLE UART central example started.");
//    scan_start();
    user_timer_start();
    uart_send_string((uint8_t *)"hello world");
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            nrf_pwr_mgmt_run();
        }
        if(tmp_flag != 0)
        {
            tc_parse(rec_result);
            tmp_flag = 0;
        }
    }
}
